# --------------------------------------------------------------------------

# Текст коментария
print("Hello, World!")
print("Hello, World !!!")

"""
Многострочный
комнетарий
"""

# --------------------------------------------------------------------------

print(1 + 2)  # 3
print(6 - 2)  # 4
print(1 - 2)  # -1
print(9 / 3)  # 3
print(9 % 3)  # 0
print(9 % 4)  # 1
print(12 // 4)  # 3
print(12 // 2)  # 6
print(-3 - 5)  # - 8
print(2 ** 2)  # 4
print(25 ** 0.5)  # 5
print(2 + 3 * 4)  # 14
print((2 + 3) * 4)  # 20
print(0.5 + 2)  # 2.5

# --------------------------------------------------------------------------

x = 1  # Переменной X присвоено значение 1
y = 1
my_var1 = 50
_my_var1 = 100
# 1my_var = 200 <- не допускается

print(type(x))
print(type(y))

TEST = 20  # <- Константа

# --------------------------------------------------------------------------
